// 创建点坐标  
var centre = new BMap.Point(118.92319, 32.098621);
// 初始化地图，设置中心点坐标和地图级别
map.centerAndZoom(centre, 17);

var foodpoint_x = new Array("118.92319","118.897053","118.922949","118.933211","118.922561","118.92203","118.923793","118.929337","118.902542","118.81985","118.832943","118.992538","118.921267","118.900882","118.932428","118.894357","118.914238","118.900818","118.914316","118.922704","118.929546","118.991886","118.915536","118.929389","118.901004","118.922704","118.927994","118.902515","118.933079","118.815034","118.997847","118.992299","118.932714","118.931122","118.921038","118.994913","118.929514","118.915178","118.929225","118.992499","118.992862","118.86375","118.880228","118.932676","118.914341","118.993535","118.965238","118.818864");
var foodpoint_y = new Array("32.098621","32.138898","32.099666","32.106362","32.099716","32.100406","32.098557","32.106705","32.059818","32.109476","32.108481","32.127719","32.100146","32.056775","32.109136","32.133938","32.103649","32.057046","32.103286","32.100009","32.106421","32.126778","32.086418","32.106733","32.056328","32.100009","32.107687","32.059015","32.107585","32.109938","32.126983","32.127598","32.108706","32.126573","32.100589","32.126274","32.103246","32.098359","32.106543","32.127617","32.127733","32.116754","32.129286","32.108721","32.103696","32.126262","32.158332","32.181397");
var foodpoint_title = new Array("homie","Patrick Wang私房甜品","西尾抹茶","爸爸糖手工吐司","恒信牛奶甜品专家","鲜入围煮·港式打边炉","海底捞火锅","左庭右院鲜牛肉火锅","海子口鲜牛火锅","小小河边鱼","炉火江湖","汉拿山","雅比斯烤肉","和风食堂","新石器烤肉","小辛家快餐店","一禾轻食","黄豆仙人·豆花轻食","斯塔提抓饭","马丁豆豆","咸亨酒店","蛙小侠","北京烤鸭","醉云喃","晋家门","大通冰室","木头人创意手工蛋糕","彤德莱火锅(马群店) ","川西集市（仙林金鹰店）","重庆捞翻天火锅","多伦多海鲜自助餐厅","翼日式料理","水林间","灵语溪烧烤店","麻喜大","诺丁牛排","Moirai轻蔬味哥本餐厅","Axis墨西哥餐厅","桃花源记","川味青年派","宝胜家","晓勇龙虾烧烤馆","龍行天虾","鸽味轩(仙林金鹰店)","壹心潮汕粥","星巴克","千佛斋素菜馆","柠檬鱼");
var foodpoint_discribe1 = new Array("高颜值网红甜品店","每一款都仿佛艺术品般精美","抹茶主题甜品店","香甜可口的纯手工吐司","小而温馨的广式甜品店","食材超新鲜的粤式火锅","服务态度超好的人气火锅店","鲜牛肉火锅领鲜品牌","牛肉主题火锅店","爱吃鱼的你不容错过","价格实惠的东北烧烤","超赞的韩国风情烧烤","肉食者不能错过的烤肉店","日式和风烧烤店","超经典的韩式烤肉店","深藏功与名的韩国小餐馆","低卡健康饮食看这里","小小豆花不一样的花样","有着浓浓新疆特色的小餐馆","热门小吃让人欲罢不能","绍兴菜百年老店","热辣如火的川菜","正宗的北京烤鸭","极具风情的云南菜","感受西北大草原的粗犷魅力","假装在香港","手工蛋糕，网红之选","分量超足，满足大胃王","逛集市吃火锅，开在集市里的火锅","重庆捞翻天，让你嗨翻天","享受自由海鲜趴","食在仙林，享如东京","自助式锅物料理","韩式烤肉，经济实惠","超好吃，实名推荐","价位合适，体验舒适","轻食系列，健康之选","我们的初衷是有心，有情，有温暖","特色湘菜，挑战你的味蕾","一菜一格，传承用心","淮扬风味","喝酒撸串吃龙虾","吃喝玩乐，尽在龍行天虾","吃鸽爽，吃鸽快乐","养生之选","全球最大的咖啡连锁店","口味超赞的素斋馆","吃鱼就到柠檬鱼");
var foodpoint_discribe2 = new Array("13：00—19：00","全天","10：30—21：30","10：00—21：30","10：30—22：30","11：00—24：00","9：00—次日7：00","11：00—22：00","全天","10：00—次日2：00","16：00—次日2：00","11：00—22:00","11：00—14：00，16：00—22：00","11：30—20：30","11：00—22：00","11：00—14：00，16：00—20：00","10：00—21：00","10：00—22：00","11：00—19：30","10：00—21：30","11：00—14：00 17：00—22：00","11：00—14：00 16：30—21：00","9：00—21：00","11：00—22：00","11：00—14：00 16：30—21：00","10:00 — 21:00","9:30 — 21:00","10:30 — 22:30","11:00 — 15:00 17:00 — 次日02:00","10:00 — 次日03:00","11:00 — 21:30","10:00 — 14:00 16:00 — 21:30","11:00 — 22:00","10:30 — 14:00 16:30 — 21:30","11:30 — 14:00 17:00 — 24:00","10:00 — 22:00","周二-周日 09:00 — 20:30","11:00 — 22:00","11:00 — 14:30 16:30 — 21:00","10:00 — 14:00 17:00 — 22:00","10:30 — 22:00","11:00 — 次日2:00","16：00 — 次日2:00","11:00 — 14:00 17:00 — 21:00","10:00 — 22:00","08:00-22:00","10：30-14：00，17：00-22：00","10：00-23：00");
var foodpoint_discribe3 = new Array("仙林大道梦天地商厦北塔楼1419-1420室","翠林北路金地明悦","仙林大学城学衡路亚东商业街","仙林学津路1号仙林金鹰湖滨天地二期B1F-43","仙林街道学衡路5号1-43室","学衡路中段苏果超市向北100米泸溪河楼上","仙林街道学衡路1号九霄梦天地商厦4层5号","学津路1号金鹰湖滨天地B区四层D-09","马群新街101号(电信局侧对面)","华电路长营村38幢","北苑东路28号","仙林大道181号南京仙林万达茂3F3026商铺","文范路苏果超市后面(康桥圣菲对面)","中山门大街招商花园城1楼","仙林大学城学海路1号金鹰奥莱城D馆G层","尧化街道前新塘丽池花园03幢16室","仙林街道仙林大学城文苑路以南文苑广场之1-107商铺","马群地铁站1号口中山门大街招商花园城一层122铺","仙林大学城文苑路8号东城汇1层(东城汇广场)","学衡路5号(水平方美食广场S-19-4)","学海路1号金鹰湖滨天地B座四层D-14号","仙林大道万达茂三楼","仙鹤门地铁站紫东创意园商业街G3幢","学则路金鹰B座4楼D-27","中山门大街699号花园城购物中心3层","学衡路5号水平方美食广场一楼","杉湖西路9号香樟园31栋16室南京银行旁第一家","马群新街89号 ","南京市栖霞区仙林学海路1号金鹰奥莱城F2","迈皋桥广场和燕路275号二楼","江苏省南京市栖霞区仙林大道181号万达茂C座三楼","江苏省南京市栖霞区守敬路南京万达茂3层","江苏省南京市栖霞区学海路1号金鹰湖滨天地2F-D05号","江苏省南京市栖霞区仙林街道学海路28号南邮广场美食街1幢103","江苏省南京市栖霞区文范路9号康桥圣菲2栋103室","仙林大道万达茂广场1号门3楼","学津路8号高科中心负一楼011号","江苏省南京市栖霞区仙隐北路12号亚东商业广场底商","仙林大学城学津路1号金鹰湖滨天地B区3楼","江苏省南京市栖霞区仙林大道181号万达茂3053A","江苏省南京市栖霞区广志路南京万达茂三楼3020B3021A","南京市栖霞区华银路20号9栋105室","栖霞区金尧路11-2号","江苏省南京市栖霞区学海路1号6-102号附近","南京市栖霞区文苑路8号东城汇B1","南京万达茂一楼","栖霞街88号(近栖霞大道)栖霞山风景名胜区内","江苏省南京市栖霞区八卦洲街道丽岛新城9幢1080室");
var foodpoint_link1 = new Array("img/4-美食类/401-布朗尼.jpg","img/4-美食类/402-三拼卷.jpg","img/4-美食类/403-抹茶冰淇淋.jpg","img/4-美食类/404-巧克力吐司.jpg","img/4-美食类/405-双皮奶.jpg","img/4-美食类/406-日式蟹柳.jpg","img/4-美食类/407-招牌虾滑.jpg","img/4-美食类/408-吊龙.jpg","img/4-美食类/409-牛肉炒饭.jpg","img/4-美食类/410-兴化鲜鱼丸.jpg","img/4-美食类/411-东北特色涮肚锅.jpg","img/4-美食类/412-烤五花肉.jpg","img/4-美食类/413-泡菜饼.jpg","img/4-美食类/414-日式照烧脆皮豆腐.jpg","img/4-美食类/415-招牌调味五花肉.jpg","img/4-美食类/416-糖醋肉.jpg","img/4-美食类/417-东南亚辣酱三文鱼波奇饭.jpg","img/4-美食类/418-椰香鲜果豆花.jpg","img/4-美食类/419-新疆老酸奶.jpg","img/4-美食类/420-剔骨乌鸡爪.jpg","img/4-美食类/421-咸亨臭豆腐.jpg","img/4-美食类/422-烤牛蛙.jpg","img/4-美食类/423-北京烤鸭.jpg","img/4-美食类/424-云南现烤鲜花饼.jpg","img/4-美食类/425-烤包子.jpg","img/4-美食类/426-丝袜奶茶.jpg","img/4-美食类/427-提拉米苏.jpg","img/4-美食类/428-羔羊肉.jpg","img/4-美食类/429-毛肚.jpg","img/4-美食类/430-招牌毛肚.jpg","img/4-美食类/431-三文鱼.jpg","img/4-美食类/432-三文鱼刺身.jpg","img/4-美食类/433-天妇罗炸虾.jpg","img/4-美食类/434-冷面.jpg","img/4-美食类/435-嫩豆腐汤.jpg","img/4-美食类/436-招牌牛排.jpg","img/4-美食类/437-盐烤秋葵三文鱼沙拉.jpg","img/4-美食类/438-啤酒玛格丽特.jpg","img/4-美食类/439-小米椒爱上小公鸡.jpg","img/4-美食类/440-双味鱼头.jpg","img/4-美食类/441-口水鸡.jpg","img/4-美食类/442-羊蝎子火锅.jpg","img/4-美食类/443-十三香龙虾.jpg","img/4-美食类/444-金牌乳鸽.jpg","img/4-美食类/445-水晶虾饺.jpg","img/4-美食类/446-外观.jpeg","img/4-美食类/447-烤麸.jpg","img/4-美食类/448-土豆粉.jpg");
var foodpoint_link2 = new Array("img/4-美食类/401-红丝绒.jpg","img/4-美食类/402-咸奶油裸蛋糕.jpg","img/4-美食类/403-抹茶千层.jpg","img/4-美食类/404-招牌吐司.jpg","img/4-美食类/405-姜汁撞奶.jpg","img/4-美食类/406-热气牛肉.jpg","img/4-美食类/407-捞派滑牛肉.jpg","img/4-美食类/408-蟹籽鲜虾滑.jpg","img/4-美食类/409-牛酥.jpg","img/4-美食类/410-茴香小油条.jpg","img/4-美食类/411-牛肥瘦.jpg","img/4-美食类/412-烤全牛.jpg","img/4-美食类/413-烤五花肉.jpg","img/4-美食类/414-日式照烧鸡排饭.jpg","img/4-美食类/415-秘制梅肉.jpg","img/4-美食类/416-锅包肉.jpg","img/4-美食类/417-冷拌一禾面.jpg","img/4-美食类/418-荔浦香芋豆花.jpg","img/4-美食类/419-碎肉手抓饭.jpg","img/4-美食类/420-爆蛋鸡柳.jpg","img/4-美食类/421-干菜焖肉.jpg","img/4-美食类/422-青椒紫苏味牛蛙.jpg","img/4-美食类/423-椒盐鸭架.jpg","img/4-美食类/424-建水汽锅鸡.jpg","img/4-美食类/425-烤羊排.jpg","img/4-美食类/426-茶走.jpg","img/4-美食类/427-豆乳盒子.jpg","img/4-美食类/428-虾滑.jpg","img/4-美食类/429-红糖糍粑.jpg","img/4-美食类/430-雪花肥牛.jpg","img/4-美食类/431-大虾.jpg","img/4-美食类/432-蟹棒.jpg","img/4-美食类/433-果彩缤纷卷.jpg","img/4-美食类/434-石锅拌饭.jpg","img/4-美食类/435-海鲜葱饼.jpg","img/4-美食类/436-美式沙朗牛排.jpg","img/4-美食类/437-盐焦鸡肉沙拉.jpg","img/4-美食类/438-至尊奶酪玉米片.jpg","img/4-美食类/439-海鲜大咖.jpg","img/4-美食类/440-宫保鸡丁.jpg","img/4-美食类/441-糖醋里脊.jpg","img/4-美食类/442-蒜泥龙虾.jpg","img/4-美食类/443-咸蛋黄龙虾.jpg","img/4-美食类/444-鸽子汤.jpg","img/4-美食类/445-皮蛋瘦肉粥.jpg","img/4-美食类/446-星冰乐.jpeg","img/4-美食类/447-素面.jpg","img/4-美食类/448-柠檬鱼.jpg");
var foodpoint_link3 = new Array("img/4-美食类/401-荔浦芋头.jpg","img/4-美食类/402-芒果西米流心慕斯.jpg","img/4-美食类/403-抹茶提拉米苏.jpg","img/4-美食类/404-皇冠芝士吐司.jpg","img/4-美食类/405-椰丝牛奶砖.jpg","img/4-美食类/406-爱跳舞的大鲍鱼.jpg","img/4-美食类/407-无刺巴沙鱼.jpg","img/4-美食类/408-鲜牛杂鸳鸯锅.jpg","img/4-美食类/409-鲜切肥牛.jpg","img/4-美食类/410-野生黄辣丁.jpg","img/4-美食类/411-碳烤鸡子蚝.jpg","img/4-美食类/412-烤黑牛雪花肉.jpg","img/4-美食类/413-烤猪排.jpg","img/4-美食类/414-日式豚骨拉面.jpg","img/4-美食类/415-芝士牛肉石锅拌饭.jpg","img/4-美食类/416-鸡蛋卷.jpg","img/4-美食类/417-虾仁荞麦面.jpg","img/4-美食类/418-陈皮红豆豆花.jpg","img/4-美食类/419-羊排.jpg","img/4-美食类/420-黄金豆豆.jpg","img/4-美食类/421-绍兴全家福.jpg","img/4-美食类/422-麻辣味牛蛙.jpg","img/4-美食类/423-绿茶佛饼.jpg","img/4-美食类/424-版纳香茅草烤鱼.jpg","img/4-美食类/425-羊肉串.jpg","img/4-美食类/426-鸡蛋仔.jpg","img/4-美食类/427-雪媚娘.jpg","img/4-美食类/428-鸭肠.jpg","img/4-美食类/429-虾滑.jpg","img/4-美食类/430-麻辣牛肉.jpg","img/4-美食类/431-牛排.jpg","img/4-美食类/432-鲍鱼.jpg","img/4-美食类/433-综合刺身拼盘.jpg","img/4-美食类/434-芝士年糕.jpg","img/4-美食类/435-烤五花肉.jpg","img/4-美食类/436-黑椒牛排.jpg","img/4-美食类/437-蔬菜沙拉.jpg","img/4-美食类/438-香烤青柠虾.jpg","img/4-美食类/439-石锅番茄牛腩.jpg","img/4-美食类/440-鱼香肉丝.jpg","img/4-美食类/441-蓝莓山药.jpg","img/4-美食类/442-麻辣龙虾.jpg","img/4-美食类/443-红烧龙虾.jpg","img/4-美食类/444-鹿儿岛虾球.jpg","img/4-美食类/445-豉汁凤爪.jpg","img/4-美食类/446-甜点.jpg","img/4-美食类/447-素鸡.jpg","img/4-美食类/448-酸菜鱼.jpg");
var foodpoint_foodname1 = new Array("布朗尼","三拼卷","抹茶冰淇淋","巧克力吐司","双皮奶","日式蟹柳","招牌虾滑","吊龙","牛肉炒饭","兴化鲜鱼丸","东北特色涮肚锅","烤五花肉","泡菜饼","日式照烧脆皮豆腐","招牌调味五花肉","糖醋肉","东南亚辣酱三文鱼波奇饭","椰香鲜果豆花","新疆老酸奶","剔骨乌鸡爪","咸亨臭豆腐","烤牛蛙","北京烤鸭","云南现烤鲜花饼","烤包子","丝袜奶茶","提拉米苏","羔羊肉","毛肚","招牌毛肚","三文鱼","三文鱼刺身","天妇罗炸虾","冷面","嫩豆腐汤","招牌牛排","盐烤秋葵三文鱼沙拉","啤酒玛格丽特","小米椒爱上小公鸡","双味鱼头","口水鸡","羊蝎子火锅","十三香龙虾","金牌乳鸽","水晶虾饺","外观","烤麸","土豆粉");
var foodpoint_foodname2 = new Array("红丝绒","咸奶油裸蛋糕","抹茶千层","招牌吐司","姜汁撞奶","热气牛肉","捞派滑牛肉","蟹籽鲜虾滑","牛酥","茴香小油条","牛肥瘦","烤全牛","烤五花肉","日式照烧鸡排饭","秘制梅肉","锅包肉","冷拌一禾面","荔浦香芋豆花","碎肉手抓饭","爆蛋鸡柳","干菜焖肉","青椒紫苏味牛蛙","椒盐鸭架","建水汽锅鸡","烤羊排","茶走","豆乳盒子","虾滑","红糖糍粑","雪花肥牛","大虾","蟹棒","果彩缤纷卷","石锅拌饭","海鲜葱饼","美式沙朗牛排","盐焦鸡肉沙拉","至尊奶酪玉米片","海鲜大咖","宫保鸡丁","糖醋里脊","蒜泥龙虾","咸蛋黄龙虾","鸽子汤","皮蛋瘦肉粥","星冰乐","素面","柠檬鱼");
var foodpoint_foodname3 = new Array("荔浦芋头","芒果西米流心慕斯","抹茶提拉米苏","皇冠芝士吐司","椰丝牛奶砖","爱跳舞的大鲍鱼","无刺巴沙鱼","鲜牛杂鸳鸯锅","鲜切肥牛","野生黄辣丁","碳烤鸡子蚝","烤黑牛雪花肉","烤猪排","日式豚骨拉面","芝士牛肉石锅拌饭","鸡蛋卷","虾仁荞麦面","陈皮红豆豆花","羊排","黄金豆豆","绍兴全家福","麻辣味牛蛙","绿茶佛饼","版纳香茅草烤鱼","羊肉串","鸡蛋仔","雪媚娘","鸭肠","虾滑","麻辣牛肉","牛排","鲍鱼","综合刺身拼盘","芝士年糕","烤五花肉","黑椒牛排","蔬菜沙拉","香烤青柠虾","石锅番茄牛腩","鱼香肉丝","蓝莓山药","麻辣龙虾","红烧龙虾","鹿儿岛虾球","豉汁凤爪","甜点","素鸡","酸菜鱼");

function addfood(point, i){
	var mk = new BMap.Marker(point,{icon:myIcon});
	map.addOverlay(mk);
	//添加图标点击事件
	mk.addEventListener("click", function(){    
		var opts = {    
			width : 200,     // 信息窗口宽度    
			height: 550,     // 信息窗口高度    
		}
		//添加信息窗口内容
		var content = '<div class="point_content_title">' + foodpoint_title[i] + '</div>' + '<br/>' +
				'<div class="point_content_discribe">' + '简介: ' + foodpoint_discribe1[i] + '</div>' +
				'<div class="point_content_discribe">' + '营业时间: ' + foodpoint_discribe2[i] + '</div>' +
				'<div class="point_content_discribe">' + '地址: ' +foodpoint_discribe3[i] + '</div>' +
				'<div class="point_content_picture"><img src = ' + foodpoint_link1[i] + ' class="food_picture" width="150px" height="100"><div>' +
				'<div class="point_content_name">' + foodpoint_foodname1[i] +'</div>' +
				'<div class="point_content_picture"><img src = ' + foodpoint_link2[i] + ' class="food_picture" width="150px" height="100"><div>' +
				'<div class="point_content_name">' + foodpoint_foodname2[i] +'</div>' +
				'<div class="point_content_picture"><img src = ' + foodpoint_link3[i] + ' class="food_picture" width="150px" height="100"><div>' +
				'<div class="point_content_name">' + foodpoint_foodname3[i] +'</div>';
		// 创建信息窗口对象 		
		var infoWindow = new BMap.InfoWindow(content, opts);  
		// 打开信息窗口   
		map.openInfoWindow(infoWindow, map.getCenter());      
	})
}

for (var i = 0; i < foodpoint_x.length; i++){
	if ( (i>=0 && i<5) || i==26 || i==27 || i==46){
		var myIcon = new BMap.Icon("img/icon/面包甜点.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
	else if ((i>=5 && i<10) || i==28 || i==29 || i==30|| i==48){
		var myIcon = new BMap.Icon("img/icon/火锅.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
	else if ((i>=10 && i<15) || i==35 || i==42 || i==43){
		var myIcon = new BMap.Icon("img/icon/烧烤.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
	else if (i>=15 && i<20){
		var myIcon = new BMap.Icon("img/icon/快餐.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
	else if ((i>=20 && i<25) || i==39 || i==40 || i==41 || i==44 || i==45){
		var myIcon = new BMap.Icon("img/icon/地方菜.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
	else if (i==31 || i==25){
		var myIcon = new BMap.Icon("img/icon/地方菜.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
		
	else if (i==47){
		var myIcon = new BMap.Icon("img/icon/素食.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
		
	else{
		var myIcon = new BMap.Icon("img/icon/外国菜.png", new BMap.Size(48,48),{
						anchor:new BMap.Size(10,25),
						imageOffset:new BMap.Size(0,0)
						});
		var point = new BMap.Point(foodpoint_x[i], foodpoint_y[i]);
		addfood(point, i);
	}
};